[
  {
    "id": 1,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/5968/5968863.png",
    "jobTitle": "Senior Software Engineer",
    "companyName": "Google",
    "remoteOrOnsite": "Remote",
    "location": "Anywhere",
    "fulltimeOrParttime": "Full-time",
    "salary": "$150,000 - $200,000 per year",
    "jobDescription": "A Senior Software Engineer designs, develops, and maintains complex software applications. They lead technical teams, collaborate with cross-functional teams, create technical documentation, investigate and troubleshoot technical issues, and stay up-to-date with the latest software development technologies.",
    "jobResponsibility": "Candidates must have excellent analytical, problem-solving, and communication skills, along with a deep understanding of software development principles and technologies. They should have experience with Agile development methodologies, testing frameworks, and version control systems. Candidates should have a bachelor's or master's degree in Computer Science or a related field, several years of experience in software development, preferably in a leadership role, and professional certifications in relevant technologies. They should have expertise in one or more programming languages, proficiency in database technologies, and the ability to work independently and collaboratively in a fast-paced environment.",
    "educationalRequirements": "Bachelor's degree in Computer Science or related field.",
    "experiences": "5+ years of experience in software engineering.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@abccorp.com"
  },
  {
    "id": 2,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/733/733547.png",
    "jobTitle": "Marketing Manager",
    "companyName": "Facebook",
    "remoteOrOnsite": "Onsite",
    "location": "San Francisco, CA",
    "fulltimeOrParttime": "Full-time",
    "salary": "$120,000 - $150,000 per year",
    "jobDescription": "A Marketing Manager is responsible for developing and executing marketing campaigns, managing budgets, analyzing market trends, and identifying target audiences. They oversee the creation of marketing materials, such as brochures, websites, and social media posts, and collaborate with cross-functional teams, such as sales and product development, to ensure that marketing campaigns align with business objectives",
    "jobResponsibility": "Candidates should have excellent communication and organizational skills, along with a creative and analytical mindset. They should have experience in marketing research and analysis, as well as expertise in marketing software and tools. Candidates should have a bachelor's or master's degree in marketing, business administration, or a related field, along with several years of experience in marketing, preferably in a leadership role. They should have a deep understanding of digital marketing strategies, social media marketing, and SEO, as well as experience managing budgets and working with cross-functional teams.",
    "educationalRequirements": "Bachelor's degree in Marketing or related field.",
    "experiences": "5+ years of experience in marketing or related field.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@xyzcompany.com"
  },
  {
    "id": 3,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/732/732221.png",
    "jobTitle": "Product Designer",
    "companyName": "Microsoft",
    "remoteOrOnsite": "Onsite",
    "location": "New York, NY",
    "fulltimeOrParttime": "Full-time",
    "salary": "$80,000 - $100,000 per year",
    "jobDescription": "A Product Designer is responsible for designing and developing user-centric products that meet business objectives. They collaborate with cross-functional teams, such as product managers and engineers, to identify user needs, design solutions, and create prototypes. They conduct user research, usability testing, and gather feedback to improve the user experience. They create design assets, such as wireframes, mockups, and prototypes, and ensure that the product design is consistent with brand guidelines.",
    "jobResponsibility": "Candidates should have excellent communication and collaboration skills, along with a strong sense of design and creativity. They should have experience in user research and testing, as well as expertise in design software and tools. Candidates should have a bachelor's or master's degree in design, human-computer interaction, or a related field, along with several years of experience in product design, preferably in a leadership role. They should have a deep understanding of user-centered design principles, interaction design, and visual design, as well as experience working with cross-functional teams and developing design systems.",
    "educationalRequirements": "Bachelor's degree in Graphic Design or related field.",
    "experiences": "3+ years of experience in product design or related field.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@designco.com"
  },
  {
    "id": 4,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/0/747.png",
    "jobTitle": "Frontend Developer",
    "companyName": "Apple",
    "remoteOrOnsite": "Onsite",
    "location": "Seattle, WA",
    "fulltimeOrParttime": "Full-time",
    "salary": "$90,000 - $120,000 per year",
    "jobDescription": "A Frontend Developer is responsible for developing and implementing user-facing web applications. They collaborate with designers, product managers, and backend developers to create responsive and engaging web interfaces. They write clean, efficient, and maintainable code using HTML, CSS, and JavaScript frameworks, such as React or Angular. They conduct code reviews, test and debug code, and ensure that the web application is optimized for performance and accessibility.",
    "jobResponsibility": "Candidates should have excellent problem-solving and communication skills, along with expertise in HTML, CSS, and JavaScript. They should have experience in building responsive web applications using modern frontend frameworks and libraries, such as React, Angular, or Vue. Candidates should have a bachelor's or master's degree in computer science or a related field, along with several years of experience in frontend development. They should have a deep understanding of web design principles, cross-browser compatibility, and web performance optimization. They should also be familiar with version control systems, such as Git, and have experience working with backend developers to integrate frontend code with backend systems.",
    "educationalRequirements": "Bachelor's degree in Computer Science or related field.",
    "experiences": "3+ years of experience in frontend development or related field.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@webdevco.com"
  },
  {
    "id": 5,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/5968/5968863.png",
    "jobTitle": "Data Scientist",
    "companyName": "Google",
    "remoteOrOnsite": "Remote",
    "location": "Anywhere",
    "fulltimeOrParttime": "Full-time",
    "salary": "$120,000 - $150,000 per year",
    "jobDescription": "A Data Scientist is responsible for analyzing and interpreting complex data to identify patterns and insights that inform business decisions. They collaborate with cross-functional teams to define business problems, design experiments, and develop statistical models. They use data visualization tools, such as Tableau or PowerBI, to present findings to stakeholders. They stay up-to-date with the latest data analysis techniques, such as machine learning, and incorporate them into their work.",
    "jobResponsibility": "Candidates should have excellent analytical and problem-solving skills, along with a deep understanding of statistical methods and data analysis techniques. They should have experience in data cleaning, manipulation, and analysis using programming languages such as Python or R. Candidates should have a bachelor's or master's degree in computer science, statistics, or a related field, along with several years of experience in data analysis or machine learning. They should have experience in working with large datasets, data visualization, and machine learning techniques such as regression, clustering, and classification. They should also have excellent communication skills and the ability to present complex information to stakeholders in a clear and concise manner.",
    "educationalRequirements": "Master's or PhD in Computer Science, Statistics, Mathematics, or related field.",
    "experiences": "5+ years of experience in data science or related field.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@dataanalytics.com"
  },
  {
    "id": 6,
    "companyLogo": "https://cdn-icons-png.flaticon.com/512/5968/5968863.png",
    "jobTitle": "Marketing Manager",
    "companyName": "Google",
    "remoteOrOnsite": "Onsite",
    "location": "San Francisco, CA",
    "fulltimeOrParttime": "Full-time",
    "salary": "$100,000 - $120,000 per year",
    "jobDescription": "A Marketing Manager is responsible for developing and executing marketing campaigns, managing budgets, analyzing market trends, and identifying target audiences. They oversee the creation of marketing materials, such as brochures, websites, and social media posts, and collaborate with cross-functional teams, such as sales and product development, to ensure that marketing campaigns align with business objectives",
    "jobResponsibility": "Candidates should have excellent communication and organizational skills, along with a creative and analytical mindset. They should have experience in marketing research and analysis, as well as expertise in marketing software and tools. Candidates should have a bachelor's or master's degree in marketing, business administration, or a related field, along with several years of experience in marketing, preferably in a leadership role. They should have a deep understanding of digital marketing strategies, social media marketing, and SEO, as well as experience managing budgets and working with cross-functional teams.",
    "educationalRequirements": "Bachelor's degree in Marketing or related field.",
    "experiences": "5+ years of experience in marketing or related field.",
    "phone": "+1 (555) 123-4567",
    "email": "jobs@marketingagency.com"
  }
]
